league-hero-backend/app/controllers/leagues_controller.rb

  def index
    leagues = League.all.order(start_date: :asc)
---
SELECT "leagues".* FROM "leagues" ORDER BY "leagues"."start_date" ASC

  def create
    @league = League.new(league_params)
    if @league.save
---
INSERT INTO "leagues" ("name", "league_format", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["league_format", "11v11"], ["start_date", "2020-07-10"], ["end_date", "2020-07-11"], ["created_at", "2020-07-11 10:43:14.021213"], ["updated_at", "2020-07-11 10:43:14.021213"]]

    def set_league
      @league = League.find_by(id: params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]