league-hero-backend/app/controllers/leagues_controller.rb

SELECT "leagues".* FROM "leagues"
---
  def index
    leagues = League.all