league-hero-backend/app/controllers/teams_controller.rb

  def index
    teams = Team.all.order(name: :asc)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC

  def create
    team = Team.new(team_params)

    if team.save
---
INSERT INTO "teams" ("name", "email", "phone", "league_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Detroit Racers"], ["email", "racer@racer.com"], ["phone", "1858385737"], ["league_id", 54], ["created_at", "2020-07-12 19:30:57.360899"], ["updated_at", "2020-07-12 19:30:57.360899"]]

    def set_team
      @team = Team.find_by(id: params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]